<template>
    <div id="country">
        <div id="chinaMap" ref="myEchart" style="height:800px;width:100%;"></div>
    </div>
</template>

<script>
  var echarts = require('echarts/lib/echarts');
  require('echarts/map/js/china') // 引入中国地图数据
  require('echarts/map/js/world') // 引入世界地图数据

  export default {
    name: 'country',
    mounted() {

      this.chinamap();

    },
    methods: {


      chinamap() {
        var myChart = echarts.init(document.getElementById("chinaMap"));
        window.addEventListener('resize', function () {
          myChart.resize()
        })
        var option = {

          backgroundColor: "LightPink",

          /*title: {
              show:true,
              text: '标题--中国地图',
              subtext: 'made by xzc',
              left:'center'
          },*/
          tooltip: {
            trigger: 'item'
          },
          //左侧小导航图标
            visualMap: {//颜色的设置  dataRange

                show:false,

                x: 'left',

                y: 'center',

                splitList: [

                    {start: 1500,color:'#000000'},

                    {start: 800, end: 1499,color:'#DB2828'},

                    {start: 600, end: 799,color:'#E85C72'},

                    {start: 400, end: 599,color:'#EE8D8D'},

                    {start: 200, end: 399,color:'#E3AEAE'},

                    {start: 100, end: 199,color:'#ef60dd'},

                    {start: 0, end: 99,color: 'rgba(252,129,151,0.87)'},



                ],

                //            min: 0,

                //            max: 2500,

                //            calculable : true,//颜色呈条状

            },
          //配置属性
          series: [{
            name: '数量',
            type: 'map',

            map: 'china',
            roam: false,
            zoom: 1.2,
            label: {
              normal: {
                show: true,
              },
              emphasis: {
                show: false
              }
            },
            data: [
              {name: '北京', value: randomData()}, {name: '天津', value: randomData()},
              {name: '上海', value: randomData()}, {name: '重庆', value: randomData()},
              {name: '河北', value: randomData()}, {name: '河南', value: randomData()},
              {name: '云南', value: randomData()}, {name: '辽宁', value: randomData()},
              {name: '黑龙江', value: randomData()}, {name: '湖南', value: randomData()},
              {name: '安徽', value: randomData()}, {name: '山东', value: randomData()},
              {name: '新疆', value: randomData()}, {name: '江苏', value: randomData()},
              {name: '浙江', value: randomData()}, {name: '江西', value: randomData()},
              {name: '湖北', value: randomData()}, {name: '广西', value: randomData()},
              {name: '甘肃', value: randomData()}, {name: '山西', value: randomData()},
              {name: '内蒙古', value: randomData()}, {name: '陕西', value: randomData()},
              {name: '吉林', value: randomData()}, {name: '福建', value: randomData()},
              {name: '贵州', value: randomData()}, {name: '广东', value: randomData()},
              {name: '青海', value: randomData()}, {name: '西藏', value: randomData()},
              {name: '四川', value: randomData()}, {name: '宁夏', value: randomData()},
              {name: '海南', value: randomData()}, {name: '台湾', value: randomData()},
              {name: '香港', value: randomData()}, {name: '澳门', value: randomData()}


            ]
          }]
        };

        //var count = -1;
        setInterval(function () {

          //var curr = count % 34; //数字为cityArr.length


          myChart.dispatchAction({
            type: 'downplay',
            seriesIndex: 0,

          });
          /*myChart.dispatchAction({
              type: 'highlight',
              seriesIndex: 0,
              dataIndex: curr
          });*/


          /*myChart.dispatchAction({
              type: 'showTip',
              seriesIndex: 0, // 因为只有一组数据，所以此处应为0
              dataIndex: curr
          });
          count++;*/

          /*
          if (index > cityArr.length - 1) {
            count = -1
          }
          */
        }, 500);


        /**
         *  使用刚指定的配置项和数据显示图表。
         *  */
        myChart.setOption(option);

        //获取随机数
        function randomData() {
          return Math.round(Math.random() * (12 - 1) + 1)
        }


// myChart.on('mouseover', function (params) {
// var dataIndex = params.dataIndex;
//                 console.log(dataIndex);
//             });


        var n = ['福州市', '莆田市', '泉州市', '厦门市', '漳州市', '龙岩市', '三明市', '南平市', '宁德市',
                '杭州市','宁波市','温州市','嘉兴市','湖州市','绍兴市','金华市','衢州市','舟山市','台州市','丽水市',
                '南京市','无锡市','徐州市','常州市','苏州市','南通市','连云港市','淮安市','盐城市','扬州市','镇江市','泰州市','宿迁市',
                '合肥市','芜湖市','蚌埠市','淮南市','马鞍山市','淮北市','铜陵市','安庆市','黄山市','滁州市','阜阳市','宿州市','巢湖市','六安市','亳州市','池州市','宣城市',
                '石家庄市','唐山市','秦皇岛市','邯郸市','邢台市','保定市','张家口市','承德市','沧州市','廊坊市','衡水市',
                '太原市','大同市','阳泉市','长治市','晋城市','朔州市','晋中市','运城市','忻州市','临汾市','吕梁市',
                '呼和浩特市','包头市','乌海市','赤峰市','通辽市','鄂尔多斯市','呼伦贝尔市','巴彦淖尔市','乌兰察布市','兴安盟','锡林郭勒盟','阿拉善盟',
                '沈阳市','大连市','鞍山市','抚顺市','本溪市','丹东市','锦州市','营口市','阜新市','辽阳市','盘锦市','铁岭市','朝阳市','葫芦岛市',
                '长春市','吉林市','四平市','辽源市','通化市','白山市','松原市',' 延边朝鲜族自治州',
                '哈尔滨市','齐齐哈尔市','鸡西市','鹤岗市',' 双鸭山市','大庆市','伊春市','佳木斯市','七台河市','牡丹江市','黑河市','绥化市','大兴安岭地区',
                '南昌市','景德镇市','萍乡市','九江市','新余市','鹰潭市','赣州市','吉安市','宜春市','抚州市','上饶市',
                '济南市','青岛市','淄博市','枣庄市','东营市','烟台市','潍坊市','济宁市','泰安市','威海市','日照市','莱芜市','临沂市','德州市','聊城市','滨州市','牡丹区',
                '郑州市','开封市','洛阳市','平顶山市','安阳市','鹤壁市','新乡市',' 焦作市','濮阳市','许昌市','漯河市','三门峡市','南阳市','商丘市','信阳市','周口市','驻马店市',
                '武汉市','黄石市','十堰市','宜昌市','襄樊市','鄂州市','荆门市','孝感市','荆州市','黄冈市','咸宁市','随州市','恩施土家族苗族自治州','仙桃市',
                '长沙市','株洲市','湘潭市','衡阳市','邵阳市','岳阳市','常德市','张家界市','益阳市','郴州市','永州市','怀化市','娄底市','湘西土家族苗族自治州',
                '广州市','韶关市','深圳市','珠海市','汕头市','佛山市','江门市','湛江市','茂名市','肇庆市','惠州市','梅州市','汕尾市','河源市','阳江市','清远市','东莞市','中山市','潮州市','揭阳市','云浮市',
                '南宁市','柳州市','桂林市','梧州市','北海市','防城港市','钦州市','贵港市','玉林市','百色市','贺州市','河池市','来宾市','崇左市',
                '海口市','三亚市','五指山市',
                '成都市','自贡市','攀枝花市','泸州市','德阳市','绵阳市','广元市','遂宁市','内江市 ','乐山市','南充市','眉山市','宜宾市','广安市','达州市','雅安市','巴中市','资阳市','阿坝藏族羌族自治州','甘孜藏族自治州','凉山彝族自治州',
                '贵阳市','六盘水市','遵义市','安顺市','铜仁地区','兴义市','毕节地区','黔东南苗族侗族自治州','黔南布依族苗族自治州',
                '昆明市','曲靖市','玉溪市','保山市','昭通市','丽江市','墨江哈尼族自治县','临沧市','楚雄彝族自治州','红河哈尼族彝族自治州','文山壮族苗族自治州','西双版纳傣族自治州','大理白族自治州','德宏傣族景颇族自治州','怒江傈僳族自治州','迪庆藏族自治州',
                '乌鲁木齐市', '克拉玛依市' ,' 吐鲁番地区' , '哈密地区', '昌吉回族自治州', '博尔塔拉蒙古自治州',  '巴音郭楞蒙古自治州', '阿克苏地区', '阿图什市', '喀什地区', '和田地区', '伊犁哈萨克自治州', '塔城地区','阿勒泰地区', '石河子市',
                '银川市' , '石嘴山市' , '吴忠市' , '固原市' , '中卫市',
                '西宁市' , '海东地区' , '海北藏族自治州', '黄南藏族自治州', '海南藏族自治州' , '果洛藏族自治州', '玉树藏族自治州', '海西蒙古族藏族自治州',
                '兰州市',  '嘉峪关市','金昌市', '白银市','天水市', '武威市', '张掖市', '平凉市', '酒泉市', '庆阳市', '定西市' , '陇南市' , '临夏回族自治州' , '甘南藏族自治州',
                '西安市' , '铜川市' , '宝鸡市' , '咸阳市' ,'渭南市' , '延安市' , '汉中市' , '榆林市' , '安康市','商洛市',
                '拉萨市' ,' 昌都地区' , '山南地区' , '日喀则地区' , '那曲地区' , '阿里地区' , '林芝地区',
                '香港','澳门','台北市',
                '北京','上海','天津','重庆'
        ]

        var j = [119.30, 118.95, 118.77, 118.18, 117.65, 117.03, 117.62, 118.07, 119.62,
                120.15,121.55,120.70,120.75,120.08,120.57,119.65,118.87,122.20,121.43,119.92,
                118.78,120.30,117.18,119.95,120.58,120.88,119.22,119.02,120.15,119.40,119.45,119.92,118.28,
                117.25,118.38,117.38,117.00,118.50,116.80,117.82,117.05,118.33,118.32,115.82,116.98,117.87,116.50,115.78,117.48,118.75,
                114.52,118.20,119.60,114.48,114.48,115.47,114.88,117.93,116.83,116.70,115.68,
                112.55,113.30,113.57,113.12,112.83,112.43,112.75,110.98,112.73,111.52,111.13,
                111.73,109.83,106.82,118.92,122.27,109.80,119.77,107.42,113.12,122.05,116.07,105.67,
                123.43,121.62,122.98,123.98,123.77,124.38,121.13,122.23,121.67,123.17,122.07,123.83,120.45,120.83,
                125.32,126.55,124.35,125.13,125.93,126.42,124.82,129.50,
                126.53,123.95,130.97,130.27,131.15,125.03,128.90,130.37,130.95,129.60,127.48,126.98,124.12,
                115.85,117.17,113.85,116.00,114.92,117.07,114.93,114.98,114.38,116.35,117.97,
                116.98,120.38,118.05,117.32,118.67,121.43,119.15,116.58,117.08,122.12,119.52,117.67,118.35,116.30,115.98,117.97,115.43,
                113.62,114.30,112.45,113.18,114.38,114.28,113.90,113.25,115.03,113.85,114.02,111.20,112.52,115.65,114.07,114.65,114.02,
                114.30,115.03,110.78,111.28,112.15,114.88,112.20,113.92,112.23,114.87,114.32,113.37,109.47,113.45,
                112.93,113.13,112.93,112.57,111.47,113.12,111.68,110.47,112.32,113.02,111.62,110.00,112.00,109.73,
                113.27,113.60,114.05,113.57,116.68,113.12,113.08,110.35,110.92,112.47,114.42,116.12,115.37,114.70,111.98,113.03,113.75,113.38,116.62,116.37,112.03,
                108.37,109.42,110.28,111.27,109.12,108.35,108.62,109.60,110.17,106.62,111.55,108.07,109.23,107.37,
                110.32,109.50,109.52,
                104.07,104.78,101.72,105.43,104.38,104.73,105.83,105.57,105.05,103.77,106.08,103.83,104.62,106.63,107.50,103.00,106.77,104.65,102.22,101.97,102.27,
                106.63,104.83,106.92,105.95,109.18,104.90,105.28,107.97,107.52,
                102.72,103.80,102.55,99.17,103.72,100.23,101.68,100.08,101.55,103.40,104.25,100.80,100.23,98.58,98.85,99.70,
                87.62,84.87,89.17,93.52,87.30,82.07,86.15,80.27,76.17,75.98,79.92 ,81.32 ,82.98,88.13,86.03,
                106.28,106.38,106.20,106.28,105.18,
                101.78,102.12,100.90,102.02,100.62,100.23,97.02,97.37,
                103.82 ,98.27,102.18,104.18,105.72,102.63,100.45,106.67,98.52,107.63,104.62,104.92,103.22,102.92,
                108.93,108.93,107.13,108.70,109.50,109.48,107.02,109.73,109.02,109.93,
                91.13,97.18,91.77,88.88 ,92.07,80.10,94.37,
                114.08,113.33,121.50,
                116.40,121.47,117.20,106.55

                ]

        var w = [26.08, 25.43, 24.88, 24.58, 24.52, 25.10, 26.27, 27.35, 26.77,
                30.28,29.88,28.00,30.75,30.90,30.00,29.08,28.93,30.00,28.68,28.45,
                32.07,31.57,34.27,31.78,31.30,31.98,34.60,33.62,33.35,32.40,32.20,32.45,33.97,
                31.83,31.33,32.92,32.63,31.70,33.95,30.93,30.53,29.72,32.30,32.90,33.63,31.60,31.77,33.85,30.67,30.95,
                38.05,39.63,39.93,36.62,37.07,38.87,40.82,40.97,38.30,39.52,37.73,
                37.87,40.08,37.85,36.20,35.50,39.33,37.68,35.02,38.42,36.08,37.52,
                40.83,40.65,39.67,42.27,43.62,39.62,49.22,40.75,40.98,46.08,43.95,38.83,
                41.80,38.92,41.10,41.88,41.30,40.13,41.10,40.67,42.02,41.27,41.12,42.28,41.57,40.72,
                43.90,43.83,43.17,42.88,41.73,41.93,45.13,42.88,
                45.80,47.33,45.30,47.33,46.63,46.58,47.73,46.82,45.78,44.58,50.25,46.63,50.42,
                28.68,29.27,27.63,29.70,27.82,28.27,25.83,27.12,27.80,28.00,28.45,
                36.67,36.07,36.82,34.82,37.43,37.45,36.70,35.42,36.20,37.52,35.42,36.22,35.05,37.45,36.45,37.38,35.25,
                34.75,34.80,34.62,33.77,36.10,35.75,35.30,35.22,35.77,34.03,33.58,34.78,33.00,34.45,32.13,33.62,32.98,
                30.60,30.20,32.65,30.70,32.02,30.40,31.03,30.93,30.33,30.45,29.85,31.72,30.30,30.37,
                28.23,27.83,27.83,26.90,27.25,29.37,29.05,29.13,28.60,25.78,26.43,27.57,27.73,28.32,
                23.13,24.82,22.55,22.27,23.35,23.02,22.58,21.27,21.67,23.05,23.12,24.28,22.78,23.73,21.87,23.70,23.05,22.52,23.67,23.55,22.92,
                22.82,24.33,25.28,23.48,21.48,21.70,21.95,23.10,22.63,23.90,24.42,24.70,23.73,22.40,
                20.03,18.25,18.78,
                30.67,29.35,26.58,28.87,31.13,31.47,32.43,30.52,29.58,29.57,30.78,30.05,28.77,30.47,31.22,29.98,31.85,30.12,31.90,30.05,27.90,
                26.65,26.60,27.73,26.25,27.72,25.08,27.30,26.58,26.27,
                25.05,25.50,24.35,25.12,27.33,26.88,23.43,23.88,25.03,23.37,23.37,22.02,25.60,24.43,25.85,27.83,
                43.82,45.60,42.95,42.83,44.02,44.90,41.77,41.17,39.72,39.47,37.12,43.92,46.75,35.58,33.40,47.85,44.30,
                38.47,39.02,37.98,36.00,37.52,
                36.62,36.50,36.97,35.52,36.28,34.48,33.00,37.37,
                36.07,39.80,38.50,36.55,34.58,37.93,38.93,35.55,39.75,35.73,35.60,34.98,
                34.27,34.90,34.37,34.33,34.50,36.60,33.07,38.28,32.68,33.87,
                29.65,31.13,29.23,29.27,31.48,32.50,29.68,
                22.20,22.13,25.03,
                39.90,31.23,39.12,29.57

      ]
        let that = this;

        myChart.on('click', function (chinaParam) {
          for (var i = 0; i < 500; i++)
            if (chinaParam.name == n[i]) {
              that.$router.push({
                "path": "/fujian",
                "query": {
                    "n":n[i],
                  "x": j[i],
                  "y": w[i],
                }
              })


             // console.log(chinaParam.name)
                break;
            }
          /*if( chinaParam.name=='北京'){

          }*/

          var option = myChart.getOption();
          option.series[0].map = chinaParam.name;
          option.series[0].mapType = chinaParam.name;
          myChart.clear();
          console.log(chinaParam.name);
          myChart.setOption(option, true);
          this.$store.commit('setArea',chinaParam.name);

        });


      }
    },
    created() {

    },
    watch: {}
  }

</script>
<style scoped>
    #fujian {
        min-height: 100vh;
    }
</style>
